Show / Hide Table of Contents
Class CalculationCase
load case/combination data
Inheritance
System.Object
OpenObject
OpenElementId
CalculationCase
LoadCase
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class CalculationCase : OpenElementId
Constructors
Improve this Doc   View Source
CalculationCase()
constructor
Declaration
public CalculationCase()
Properties
Improve this Doc   View Source
IsActive
active load case/combination
Declaration
public bool IsActive { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Name
Gets or set the name
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source